src/cf/InformationRegisters/КанбанЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанЛидов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЛидов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантЗавершенияРаботыСЛидом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КанбанЛидов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавление лида в работе в конец канбана
//
// Параметры:
//  Состояние - СправочникСсылка.СостоянияЛидов
//  Лид - СправочникСсылка.Лиды
//
Процедура ДобавитьЛидВКонец(Состояние, Лид) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.КанбанЛидов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Состояние = Состояние;
	МенеджерЗаписи.Лид = Лид;
	МенеджерЗаписи.Порядок = НовыйКрайнийПорядковыйНомер(Состояние);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Перемещение лида между состояниями или возврат лида в работу
//
// Параметры:
//  СостояниеПредыдущее - СправочникСсылка.СостоянияЛидов
//  СостояниеНовое - СправочникСсылка.СостоянияЛидов
//  Лид - СправочникСсылка.Лиды
//  Порядок - Число, Неопределено
//  ПредыдущийВариантЗавершения - ПеречислениеСсылка.ВариантЗавершенияРаботыСЛидом, Неопределено
//
Процедура ПереместитьЛид(
	СостояниеПредыдущее, СостояниеНовое, Лид, Порядок = Неопределено, ПредыдущийВариантЗавершения = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.КанбанЛидов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Состояние = СостояниеПредыдущее;
		МенеджерЗаписи.Лид = Лид;
		
		Если ПредыдущийВариантЗавершения <> Неопределено Тогда
			МенеджерЗаписи.ВариантЗавершения = ПредыдущийВариантЗавершения;
		КонецЕсли;
		
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
		
		Если Порядок = Неопределено Тогда
			Порядок = НовыйКрайнийПорядковыйНомер(СостояниеНовое);
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.КанбанЛидов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Состояние.Установить(СостояниеНовое);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			Если Запись.Порядок < Порядок Тогда
				Продолжить;
			КонецЕсли;
			Запись.Порядок = Запись.Порядок + 1;
		КонецЦикла;
		
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Состояние = СостояниеНовое;
		НоваяСтрока.Лид = Лид;
		НоваяСтрока.Порядок = Порядок;
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

// Смена порядков лидов
//
// Параметры:
//  ДанныеПеретаскиваемыхЛидов - Структура:
//   * СсылкаНаПервыйЛид - СправочникСсылка.Лиды
//   * СсылкаНаВторойЛид - СправочникСсылка.Лиды
//   * ПорядокПервогоЛида - Число
//   * ПорядокВторогоЛида - Число
//   * Состояние - СправочникСсылка.СостоянияЛидов
//
Процедура ПоменятьПорядкиЛидов(ДанныеПеретаскиваемыхЛидов) Экспорт
	
	МенеджерЗаписиПервого = РегистрыСведений.КанбанЛидов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиПервого.Лид = ДанныеПеретаскиваемыхЛидов.СсылкаНаПервыйЛид;
	МенеджерЗаписиПервого.Порядок = ДанныеПеретаскиваемыхЛидов.ПорядокВторогоЛида;
	МенеджерЗаписиПервого.Состояние = ДанныеПеретаскиваемыхЛидов.Состояние;
	МенеджерЗаписиПервого.Записать();
	
	МенеджерЗаписиВторого = РегистрыСведений.КанбанЛидов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписиВторого.Лид = ДанныеПеретаскиваемыхЛидов.СсылкаНаВторойЛид;
	МенеджерЗаписиВторого.Порядок = ДанныеПеретаскиваемыхЛидов.ПорядокПервогоЛида;
	МенеджерЗаписиВторого.Состояние = ДанныеПеретаскиваемыхЛидов.Состояние;
	МенеджерЗаписиВторого.Записать();
	
КонецПроцедуры

// Перемещение нескольких лидов
//
// Параметры:
//  СостояниеПредыдущее - СправочникСсылка.СостоянияЛидов
//  СостояниеНовое - СправочникСсылка.СостоянияЛидов
//  Лиды - СправочникСсылка.Лиды
//  Порядок - Число, Неопределено
//
Процедура ПереместитьЛиды(СостояниеПредыдущее, СостояниеНовое, Лиды, Порядок = Неопределено) Экспорт
	
	Если Порядок = Неопределено Тогда
		Порядок = НовыйКрайнийПорядковыйНомер(СостояниеНовое);
	КонецЕсли;
	
	ПорядокПервогоЛида = Порядок;
	
	Для Каждого Лид Из Лиды Цикл
		
		МенеджерЗаписи = РегистрыСведений.КанбанЛидов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Состояние = СостояниеПредыдущее;
		МенеджерЗаписи.Лид = Лид;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.КанбанЛидов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Состояние.Установить(СостояниеНовое);
	НаборЗаписей.Прочитать();
	
	Для Каждого Лид Из Лиды Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Состояние = СостояниеНовое;
		НоваяСтрока.Лид = Лид;
		НоваяСтрока.Порядок = Порядок;
		Порядок = Порядок + 1;
	КонецЦикла;
	
	Для каждого Запись Из НаборЗаписей Цикл
		НайденныйЛид = Лиды.Найти(Запись.Лид);
		Если Запись.Порядок < ПорядокПервогоЛида ИЛИ НайденныйЛид <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Запись.Порядок = Запись.Порядок + Лиды.Количество();
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Проверка, есть ли лид в канбане
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
// 
// Возвращаемое значение:
//  Булево
//
Функция ЛидЕстьВКанбане(Лид) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КанбанЛидов.Лид КАК Лид
		|ИЗ
		|	РегистрСведений.КанбанЛидов КАК КанбанЛидов
		|ГДЕ
		|	КанбанЛидов.Лид = &Лид";
	
	Запрос.УстановитьПараметр("Лид", Лид);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Добавление завершенного лида
//
// Параметры:
//  Лид - СправочникСсылка.Лиды
//  ВариантЗавершения - ПеречислениеСсылка.ВариантЗавершенияРаботыСЛидом
//
Процедура ДобавитьЗавершенныйЛид(Лид, ВариантЗавершения) Экспорт
	
	НаборЗаписей = РегистрыСведений.КанбанЛидов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Лид.Установить(Лид);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Лид = Лид;
	НоваяЗапись.Состояние = Справочники.СостоянияЛидов.Завершен;
	НоваяЗапись.ВариантЗавершения = ВариантЗавершения;
	НоваяЗапись.Порядок = НовыйКрайнийПорядковыйНомер(, ВариантЗавершения);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Порядковый номер, выше последнего порядкого номера по состоянию или завершению на 1
//
// Параметры:
//  Состояние - СправочникСсылка.СостоянияЛидов, Неопределено
//  ВариантЗавершения - ПеречислениеСсылка.ВариантЗавершенияРаботыСЛидом, Неопределено
// 
// Возвращаемое значение:
//  Число
//
Функция НовыйКрайнийПорядковыйНомер(Состояние = Неопределено, ВариантЗавершения = Неопределено) Экспорт
	
	Если Состояние = Неопределено И ВариантЗавершения = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Порядок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КанбанЛидов.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.КанбанЛидов КАК КанбанЛидов
	|ГДЕ
	|	КанбанЛидов.Состояние = &Состояние
	|
	|УПОРЯДОЧИТЬ ПО
	|	КанбанЛидов.Порядок УБЫВ";
	
	Если ЗначениеЗаполнено(Состояние) Тогда
		Запрос.Параметры.Вставить("Состояние", Состояние);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"КанбанЛидов.Состояние = &Состояние", "КанбанЛидов.ВариантЗавершения = &ВариантЗавершения");
		Запрос.Параметры.Вставить("ВариантЗавершения", ВариантЗавершения);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Порядок = Выборка.Порядок + 1;
	КонецЕсли;
	
	Возврат Порядок;
	
КонецФункции

#КонецОбласти

#КонецЕсли
